inventory_service_perf/wrk_report/inventory_python311_metrics_error_logger_wrk.txt
(venv310) dr@eniac-bench:~/devel/wrk2$ ./wrk  --latency -t1 -R1200  -c 100 -d 120  http://eniac-bench:8080/metrics 
Running 2m test @ http://eniac-bench:8080/metrics
  1 threads and 100 connections
  Thread calibration: mean lat.: 1.768ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.78ms  652.67us  10.71ms   70.71%
    Req/Sec     1.28k    92.85     1.78k    79.16%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.69ms
 75.000%    2.18ms
 90.000%    2.63ms
 99.000%    3.59ms
 99.900%    4.24ms
 99.990%    9.42ms
 99.999%   10.57ms
100.000%   10.72ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.611     0.000000            1         1.00
       0.984     0.100000        13165         1.11
       1.240     0.200000        26281         1.25
       1.395     0.300000        39427         1.43
       1.540     0.400000        52580         1.67
       1.690     0.500000        65714         2.00
       1.770     0.550000        72344         2.22
       1.854     0.600000        78888         2.50
       1.952     0.650000        85431         2.86
       2.065     0.700000        91986         3.33
       2.177     0.750000        98583         4.00
       2.235     0.775000       101891         4.44
       2.293     0.800000       105132         5.00
       2.355     0.825000       108478         5.71
       2.417     0.850000       111798         6.67
       2.495     0.875000       115012         8.00
       2.557     0.887500       116660         8.89
       2.631     0.900000       118264        10.00
       2.705     0.912500       119944        11.43
       2.779     0.925000       121564        13.33
       2.857     0.937500       123213        16.00
       2.891     0.943750       124023        17.78
       2.929     0.950000       124840        20.00
       2.969     0.956250       125666        22.86
       3.013     0.962500       126478        26.67
       3.105     0.968750       127294        32.00
       3.213     0.971875       127709        35.56
       3.303     0.975000       128119        40.00
       3.379     0.978125       128534        45.71
       3.447     0.981250       128944        53.33
       3.501     0.984375       129349        64.00
       3.527     0.985938       129556        71.11
       3.549     0.987500       129767        80.00
       3.575     0.989062       129972        91.43
       3.599     0.990625       130172       106.67
       3.623     0.992188       130395       128.00
       3.633     0.992969       130480       142.22
       3.649     0.993750       130586       160.00
       3.669     0.994531       130689       182.86
       3.701     0.995313       130793       213.33
       3.743     0.996094       130888       256.00
       3.773     0.996484       130940       284.44
       3.821     0.996875       130990       320.00
       3.865     0.997266       131042       365.71
       3.917     0.997656       131093       426.67
       3.975     0.998047       131144       512.00
       4.015     0.998242       131170       568.89
       4.087     0.998437       131196       640.00
       4.131     0.998633       131221       731.43
       4.183     0.998828       131248       853.33
       4.243     0.999023       131274      1024.00
       4.319     0.999121       131285      1137.78
       4.431     0.999219       131299      1280.00
       4.531     0.999316       131311      1462.86
       5.411     0.999414       131324      1706.67
       6.183     0.999512       131336      2048.00
       6.783     0.999561       131343      2275.56
       7.103     0.999609       131349      2560.00
       7.499     0.999658       131356      2925.71
       7.867     0.999707       131362      3413.33
       8.039     0.999756       131368      4096.00
       8.263     0.999780       131372      4551.11
       8.455     0.999805       131375      5120.00
       8.583     0.999829       131378      5851.43
       8.855     0.999854       131381      6826.67
       9.279     0.999878       131384      8192.00
       9.415     0.999890       131386      9102.22
       9.495     0.999902       131388     10240.00
       9.591     0.999915       131389     11702.86
       9.727     0.999927       131391     13653.33
       9.743     0.999939       131392     16384.00
       9.807     0.999945       131393     18204.44
       9.879     0.999951       131394     20480.00
       9.991     0.999957       131395     23405.71
      10.119     0.999963       131396     27306.67
      10.119     0.999969       131396     32768.00
      10.207     0.999973       131397     36408.89
      10.207     0.999976       131397     40960.00
      10.351     0.999979       131398     46811.43
      10.351     0.999982       131398     54613.33
      10.351     0.999985       131398     65536.00
      10.567     0.999986       131399     72817.78
      10.567     0.999988       131399     81920.00
      10.567     0.999989       131399     93622.86
      10.567     0.999991       131399    109226.67
      10.567     0.999992       131399    131072.00
      10.719     0.999993       131400    145635.56
      10.719     1.000000       131400          inf
#[Mean    =        1.776, StdDeviation   =        0.653]
#[Max     =       10.712, Total count    =       131400]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  143751 requests in 2.00m, 1.01GB read
Requests/sec:   1197.92
Transfer/sec:      8.65MB