inventory_service_perf/wrk_report/inventory_python311_metrics_info_logger_wrk.txt
(venv310) dr@eniac-bench:~/devel/wrk2$ ./wrk  --latency -t1 -R1200  -c 100 -d 120  http://eniac-bench:8080/metrics 
Running 2m test @ http://eniac-bench:8080/metrics
  1 threads and 100 connections
  Thread calibration: mean lat.: 2.210ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.10ms    2.24ms  36.64ms   98.11%
    Req/Sec     1.24k   130.28     2.00k    78.99%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.80ms
 75.000%    2.27ms
 90.000%    2.78ms
 99.000%   13.53ms
 99.900%   28.98ms
 99.990%   35.46ms
 99.999%   36.67ms
100.000%   36.67ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.646     0.000000            1         1.00
       1.048     0.100000        13177         1.11
       1.315     0.200000        26313         1.25
       1.483     0.300000        39481         1.43
       1.643     0.400000        52570         1.67
       1.804     0.500000        65728         2.00
       1.883     0.550000        72315         2.22
       1.969     0.600000        78887         2.50
       2.065     0.650000        85511         2.86
       2.165     0.700000        91997         3.33
       2.273     0.750000        98596         4.00
       2.329     0.775000       101879         4.44
       2.391     0.800000       105193         5.00
       2.453     0.825000       108429         5.71
       2.537     0.850000       111749         6.67
       2.647     0.875000       115025         8.00
       2.709     0.887500       116618         8.89
       2.779     0.900000       118264        10.00
       2.857     0.912500       119919        11.43
       2.933     0.925000       121570        13.33
       3.019     0.937500       123215        16.00
       3.063     0.943750       124035        17.78
       3.117     0.950000       124832        20.00
       3.249     0.956250       125653        22.86
       3.447     0.962500       126473        26.67
       3.603     0.968750       127302        32.00
       3.667     0.971875       127714        35.56
       3.729     0.975000       128124        40.00
       3.965     0.978125       128526        45.71
       4.371     0.981250       128938        53.33
       7.227     0.984375       129346        64.00
       8.863     0.985938       129552        71.11
      10.447     0.987500       129757        80.00
      12.295     0.989062       129962        91.43
      14.439     0.990625       130168       106.67
      16.607     0.992188       130373       128.00
      17.839     0.992969       130477       142.22
      19.215     0.993750       130579       160.00
      20.447     0.994531       130681       182.86
      21.839     0.995313       130784       213.33
      23.215     0.996094       130888       256.00
      23.871     0.996484       130940       284.44
      24.623     0.996875       130991       320.00
      25.327     0.997266       131040       365.71
      26.191     0.997656       131092       426.67
      27.039     0.998047       131143       512.00
      27.599     0.998242       131169       568.89
      27.871     0.998437       131194       640.00
      28.239     0.998633       131221       731.43
      28.623     0.998828       131246       853.33
      28.991     0.999023       131271      1024.00
      29.199     0.999121       131284      1137.78
      29.375     0.999219       131297      1280.00
      29.583     0.999316       131310      1462.86
      29.871     0.999414       131323      1706.67
      30.143     0.999512       131335      2048.00
      30.399     0.999561       131342      2275.56
      30.623     0.999609       131348      2560.00
      30.879     0.999658       131355      2925.71
      31.919     0.999707       131361      3413.33
      33.023     0.999756       131367      4096.00
      33.951     0.999780       131371      4551.11
      34.239     0.999805       131374      5120.00
      34.495     0.999829       131377      5851.43
      35.103     0.999854       131380      6826.67
      35.167     0.999878       131383      8192.00
      35.359     0.999890       131385      9102.22
      35.551     0.999902       131387     10240.00
      35.583     0.999915       131388     11702.86
      35.679     0.999927       131390     13653.33
      35.807     0.999939       131391     16384.00
      35.839     0.999945       131392     18204.44
      35.935     0.999951       131393     20480.00
      36.095     0.999957       131394     23405.71
      36.159     0.999963       131395     27306.67
      36.159     0.999969       131395     32768.00
      36.191     0.999973       131396     36408.89
      36.191     0.999976       131396     40960.00
      36.511     0.999979       131397     46811.43
      36.511     0.999982       131397     54613.33
      36.511     0.999985       131397     65536.00
      36.671     0.999986       131399     72817.78
      36.671     1.000000       131399          inf
#[Mean    =        2.104, StdDeviation   =        2.242]
#[Max     =       36.640, Total count    =       131399]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  143750 requests in 2.00m, 1.01GB read
Requests/sec:   1197.91
Transfer/sec:      8.64MB